{
  "education": [
    {
      "awards_achievements": [
        "Dean's List: Was on the Dean's list by achieving a term GPA above 3.5",
        "The Presidential Entrance Scholarship: Given to students entering McMaster University, is awarded to those who have achieved a minimum grade point average of 3.7/4.0."
      ],
      "degree": "B.A.Sc. Honours, Computer Science",
      "department": "Department of Engineering",
      "duration": "2018-2022",
      "school_name": "McMaster University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-parsaabadi",
  "highlighted_projects": [
    {
      "description": "The 4WW3 Project is a website that allows users to browse and contribute reviews of geographically based objects. The website utilizes a combination of technologies to provide a seamless user experience. The front-end of the website is built using HTML, CSS and JavaScript, which are used to create the layout, styling and interactive features of the website. On the back-end, the website utilizes PHP to handle server-side tasks such as user authentication and data management. Additionally, the website uses .htaccess to accept php for secure user authorization and Git for version control. The site also uses Jquery and Bootstrap for responsive design and have some animation implemented using animate.css.",
      "git_url": "https://github.com/parsaabadi/4ww3-project01",
      "name": "Web Development Local Business Review App"
    },
    {
      "description": "The project involved modifying a pre-existing P0 Compiler to include new features such as universal quantifiers, array builders, set builders, and existential quantifiers. These extensions were implemented by modifying files located in the src folder and adding new files required to extend the original P0 compiler capabilities. These new features allow for the use of quantified expressions in the P0 language, similar to those found in languages like Python, where they can be implemented through external libraries or custom designs. The project aims to enhance the P0 compiler's capabilities by adding support for universal and existential quantifiers, array builders, and set builders.",
      "git_url": "https://github.com/parsaabadi/Compiler-Final-Version",
      "name": "Python Custom Compiler"
    },
    {
      "description": "Spray Post is an innovative communication app that allows users to connect with others in close proximity using cutting-edge technology, Swift, and cloud services. It uses location-based services to identify nearby users and enables real-time communication through text, audio, and video messages, and even voice and video calls. The app also includes features such as creating and joining groups, a built-in social media platform, and sharing location with friends and family. Additionally, Spray Post prioritizes user security and privacy, with customizable profiles and settings. With its many functionalities, Spray Post is an easy and efficient way for users to communicate with those in close proximity.",
      "git_url": "https://github.com/parsaabadi/Startup",
      "name": "SprayPost"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Linux nodes within a cluster are monitored for their hardware specifications and usage, with the collected data being stored in a PostgreSQL database utilizing Docker, Bash scripts, and Linux commands such as crontab. The PostgreSQL database runs within a Docker container, configured using a Bash script, while additional Bash scripts gather the data from the machines utilizing Linux commands such as lscpu, vmstat, and psql. The scripts are scheduled to run every minute through crontab for continuous monitoring.",
      "git_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-parsaabadi/tree/main/linux_sql",
      "name": "Linux Cluster Monitor"
    }
  ],
  "name": "Parsa Abadi",
  "others": [
    {
      "bullets": [
        "Painting (Realism, Oil, Photorealism)",
        "Active member of the Richmond Hill Volleyball team.",
        "Participated in chess tournaments while attending McMaster University"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Joined as a Technical Consultant, I have been gaining experience in new technologies such as Linux, SQL, Java, and Spring by working on projects in an Agile/Scrum environment. These technologies are commonly used in the professional workplace for clients similar to CIBC, National Bank, and Teranet.",
      "duration": "2023-present",
      "title": "Technical Consultant"
    },
    {
      "company": "McScert",
      "description": "Led the team in maintaining and regularly updating documentations for pods using JIRA. I also collected user requirements for building and maintaining code for tools, and applied principles of safety engineering to software development in a model-driven environment. This resulted in a boost of 10% development efficiency through testing for bugs. I conducted regular team meetings to share project status, issues, and ideas, rapidly prototyped new capabilities to confirm feasibility, and deployed inter-device communications such as SPI, I2C, and UART. Additionally, I re-designed the auto-layout system for the framework resulting in 20% better readability for testing software.",
      "duration": "2021-2022",
      "title": "Research Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "HTML/CSS",
      "NodeJS",
      "Docker",
      "Linux/Bash",
      "AWS",
      "REST APIs"
    ],
    "familiar": [
      "C#",
      "Spring",
      "ASP.NET",
      "C/C++",
      "Ruby",
      "Haskell"
    ],
    "proficient": [
      "Git",
      "Angular/React",
      "Agile/Scrum",
      "Python",
      "RDBMS/SQL"
    ]
  },
  "summary": "I am an active team player who is curious, maintains a strict schedule, and adheres to established protocols. I recently graduated from McMaster University with a Bachelor of Applied Science in Honours Computer Science and have a strong academic record. I gained expertise in the tech and IT industry through my studies and as a research engineer at McScert, where I maintained and updated documentations for pods using JIRA, collected user requirements for building and maintaining code for tools, and applied principles of safety engineering to software development in a model-driven environment. Additionally, I am part of a city wide volleyball team and enjoy playing chess competitively. I am excited for the opportunity to prove myself as a valuable team member in the software development industry."
}
